pgbench/c5d.metal/ro-32.txt
pgbench (14.5)
transaction type: <builtin: select only>
scaling factor: 1000
query mode: simple
number of clients: 32
number of threads: 32
duration: 180 s
number of transactions actually processed: 97255099
latency average = 0.059 ms
latency stddev = 0.015 ms
initial connection time = 16.917 ms
tps = 540355.878336 (without initial connection time)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.058  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;