pgbench/c5d.metal/ro-4.txt
pgbench (14.5)
transaction type: <builtin: select only>
scaling factor: 1000
query mode: simple
number of clients: 4
number of threads: 4
duration: 180 s
number of transactions actually processed: 16475985
latency average = 0.044 ms
latency stddev = 0.003 ms
initial connection time = 4.466 ms
tps = 91535.479397 (without initial connection time)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.043  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;