pgbench/c5d.metal/ro-64.txt
pgbench (14.5)
transaction type: <builtin: select only>
scaling factor: 1000
query mode: simple
number of clients: 64
number of threads: 64
duration: 180 s
number of transactions actually processed: 124152550
latency average = 0.092 ms
latency stddev = 0.047 ms
initial connection time = 24.700 ms
tps = 689821.279062 (without initial connection time)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.090  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;