pgbench/c5d.metal/ro-8.txt
pgbench (14.5)
transaction type: <builtin: select only>
scaling factor: 1000
query mode: simple
number of clients: 8
number of threads: 8
duration: 180 s
number of transactions actually processed: 31874858
latency average = 0.045 ms
latency stddev = 0.004 ms
initial connection time = 5.891 ms
tps = 177088.233896 (without initial connection time)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.044  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;